//Ch4Ex1 Напишите программу, которая выводит числа от 1 до 100
package ru.kulichenkom.ekkel.chapter4;

public class counter {
    public static void main(String[] args) {
        for (int i = 1; i < 101; i++) {
            System.out.println(i);
        }
    }
}
